document.getElementById("language").onclick = setLanguage;

translation_list_a=[
    ["Юрта", "Киіз үй"],
    ["Легенды", "Аңыздар"],
    ["Доска почёта", "Құрмет тақтасы"],
    ["В путь!","Жолға!"],
    ["О проекте","Жоба туралы"],
    ["Узнать больше","Көбірек біліңіз"]]
translation_list_h1=[
    ["Райымбек батыр","Раимбек батыр"],["Лучница Томирис","Садақшы Томирис"],["Хан Бейбарыс","Бейбарыс Хан"],["Верный Дос", "Адал Дос"],
    ["Предисловие игры:","Ойынның алғысөзі:"]]
translation_list_h2=[
    ["Познай величества современных технологий с героями родной культуры и покори вершины программирования с новой интерактивной игрой","Туған мәдениеттің кейіпкерлерімен заманауи технологиялардың ұлылығын біліңіз және жаңа интерактивті ойынмен бағдарламалаудың шыңдарын бағындырыңыз"],
    ["Научный проект","Ғылыми жоба"],
    ["С самого рождения в его сердце горело пламя воина: он отважный и гордый защитник своей родной земли.","Туғаннан бастап оның жүрегінде жауынгердің жалыны жанып тұрды: ол өз жерінің батыл және мақтаншақ қорғаушысы."],
    ["Опытная лучница, верная спутница батыра Райымбека. Всегда готова прийти на помощь в самые трудные моменты.","Тәжірибелі садақшы, батыр Райымбектің адал серігі. Ең қиын сәттерде көмекке келуге әрқашан дайын."],
    ["Мудрый хан, одаривший свободой и независимостью свой аул. Не найти было души чище.","Өз ауылына еркіндік пен тәуелсіздік берген дана хан. Жан таза емес еді."],
    ["Верный, спокойный и отважный пёс, готовый стать надёжным спутником как на охоте, так и в бою.","Аңшылықта да, ұрыста да сенімді серік болуға дайын адал, сабырлы және батыл ит."],
    ["Характеристики:","Сипаттамалары:"],
    ["Батыр Райымбек - это храбрый воин, готовый справиться с любой задачей ради своей чести и родины. С самого детства его обучали работе с оружием, из-за чего он и стал опытным воином.","Батыр Райымбек-өзінің абыройы мен Отаны үшін кез келген тапсырманы орындауға дайын батыл жауынгер. Бала кезінен бастап ол қару-жарақпен жұмыс істеуге үйретілді, сондықтан ол тәжірибелі жауынгер болды."],
    ["Задача батыра Райымбека - это помощь своему главнокомандующему, а также хану родного аула - хану Бейбарысу. К тому же, в момент потери собаки на территории Казахского ханства проходило масштабное сражение с джунгарами, из-за чего страна нуждалась в помощи от своих бравых воинов. Хан собирается не только спасти традиционное животное, но и помочь своей родине в борьбе с грозными джунгарами, повергшими в плен многие аулы.","Батыр Райымбектің міндеті - өзінің бас қолбасшысы, сондай-ақ туған ауыл ханы-Бейбарыс ханға көмек көрсету. Сонымен қатар, ит жоғалған сәтте Қазақ хандығының аумағында жоңғарлармен ауқымды шайқас өтті, соның салдарынан ел өзінің батыл жауынгерлерінен көмекке мұқтаж болды. Хан дәстүрлі жануарды құтқарып қана қоймай, көптеген ауылдарды тұтқындаған жоңғарларға қарсы күресте өз Отанына көмектеспекші."],
    ["Лучница Томирис - это стойкая и меткая лучница, которая своим луком может справиться с любым джунгаром. Отправляется на помощь батыру Райымбеку.","Томирис садақшысы-садақпен кез келген жоңғарды жеңе алатын тұрақты және дәл садақшы. Батыр Райымбекке көмекке жіберіледі."],
    ["Задача лучницы Томирис - это помочь батыру Райымбеку в бою с джунгарами, помогая ему в бою и подбадривая его к победе. Она собирается использовать своё оружие и волю чтобы преодолеть тяжелые препятствия и победить грозных джунгар.","Садақшы Томиристің міндеті - батыр Райымбекке жоңғарлармен шайқаста көмектесу, оған шайқаста көмектесу және оны жеңіске жетелеу. Ол өзінің қаруы мен ерік-жігерін ауыр кедергілерді жеңу және қорқынышты жоңғарларды жеңу үшін пайдаланады."],
    ["Хан Бейбарыс - это наимудрейший житель аула и главнокомандующий войск. Он использует свои знания и умения для поддержания своего родного аула.","Бейбарыс Хан-ауылдың ең көнерген тұрғыны және әскерлердің Бас қолбасшысы. Ол өзінің білімі мен дағдыларын туған ауылын қолдау үшін пайдаланады."],
    ["Задача хана Бейбарыса - это сохранение традиций аула и поражение джунгарских войск. Он является представителем ценнейшего рода Төре и поддержание традиций - это значимая часть его жизни. Хан собирается грамотно создать план проникновения на военную базу джунгар и взятие полного контроля над их правителем, высвобождая своего питомца из плена.","Бейбарыс ханның міндеті-ауыл дәстүрін сақтау және жоңғар әскерлерін жеңу. Ол төренің ең құнды түрінің өкілі және дәстүрді сақтау-оның өмірінің маңызды бөлігі. Хан жоңғар әскери базасына ену жоспарын сауатты түрде құрып, үй жануарларын тұтқыннан босатып, олардың билеушісіне толық бақылау жасамақшы."],
    ["Верный Дос - это пёс породы тазы. В силу своего возраста, он на вершине своей активности и его охотничьи инстинкты позволяют ему охотиться с легкостью.","Адал Дос-тазы тұқымының иті. Жасына байланысты ол өзінің белсенділігінің шыңында және аңшылық бейнеқосылғылары оған оңай аң аулауға мүмкіндік береді."],
    ["Дос - это питомец хана Бейбарыса и является местным традиционным животным. В один на первый взгляд спокойный день, его похищают джунгары, тайно отправленные их правителем Контайшы. Вопреки злобным планам грозных джунгар, хан и его воины должны составить надёжный план и справиться с тяжелой задачей спасения питомца и поражения джунгарских войск.","Дос-Бейбарыс ханның үй жануары және жергілікті дәстүрлі жануар. Бір қарағанда тыныш күнде оны билеушісі Контайша жасырын түрде жіберген жоңғарлар ұрлап кетеді. Қорқынышты жоңғарлардың зұлым жоспарларына қарамастан, хан мен оның жауынгерлері сенімді жоспар құрып, үй жануарларын құтқару мен жоңғар әскерлерін жеңудің ауыр міндетін шешуі керек."],
    ["Мой проект - это в первую очередь попытка улучшения понимания и вовлечения детей подросткового возраста в области программирования. Мой проект содержит в себе элементы истории средневекового Казахстана, грамотно составленный сюжет, удобный и полный информации вэбсайт, тематику казахской культуры и самое главное - это интерактивную игру, позволяющую обучаться с развлекательном формате ученикам как продвинутым, так и слабо знающим язык программирования Python.","Менің жобам, ең алдымен, жасөспірім балаларды бағдарламалау саласында түсінуді және тартуды жақсарту әрекеті. Менің жобамда ортағасырлық Қазақстан тарихының элементтері, сауатты құрастырылған сюжет, ыңғайлы және ақпаратқа толы вебсайт, қазақ мәдениетінің тақырыбы және ең бастысы - бұл Python бағдарламалау тілін жетік білмейтін оқушыларға ойын-сауық форматында білім алуға мүмкіндік беретін интерактивті ойын."],
    ["Цель моего проекта - создание виртуальной игры Python Batyr, которая позволит закрепить и расширить знания языка программирования Python в увлекательной форме.","Менің жобамның мақсаты-Python бағдарламалау тілін қызықты түрде бекітуге және кеңейтуге мүмкіндік беретін Python batyr виртуалды ойынын құру."],
    ["Актуальность моего проекта обусловлена тем, что интерактивные игры интересны как детям, так и взрослым, а умение разрабатывать такие игры становится важным и востребованным навыком при изучении основ программирования.","Менің жобамның өзектілігі интерактивті ойындар балаларға да, ересектерге де қызықты болғандықтан, мұндай ойындарды дамыта білу бағдарламалау негіздерін үйрену кезінде маңызды және сұранысқа ие дағдыға айналады."],
    ["В чём заключается уникальность моего проекта?","Менің жобамның бірегейлігі неде?"],
    ["Во-первых, это рост интереса к геймдизайну: в Казахстане активно развиваются курсы по программированию и часто проходят хакатоны;","Біріншіден, бұл геймдизайнға деген қызығушылықтың артуы: Қазақстанда бағдарламалау курстары белсенді дамып келеді және хакатондар жиі өтеді;"],
    ["Во-вторых, это важность edutainment подхода: игра сочетает в себе геймификацию с образовательной целью, что способствует росту мотивации и качества обучения;","Екіншіден, бұл edutainment тәсілінің маңыздылығы: ойын геймификацияны білім беру мақсатымен біріктіреді, бұл мотивация мен оқу сапасының өсуіне ықпал етеді;"],
    ["И в-третьих, это конечно же доступность: игра проста в освоении и позволяет обучаться в игровом формате даже новичкам.","Үшіншіден, бұл, әрине, қол жетімділік: ойынды үйрену оңай және тіпті жаңадан бастаушыларға да ойын форматында үйренуге мүмкіндік береді."],
    []]
translation_list_p=[
    ["Собаку хана Бейбарыса, Доса, похитили джунгары, а их правитель, Контайшы, держит собаку породы тазы в заложниках. Батыр Райымбек и лучница Томирис готовы отправиться на помощь своему главнокомандующему.","Хан Бейбарыстың иті Досаны жоңғарлар ұрлап әкеткен ,ал олардың билеушісі Контайши тазы тұқымының итін кепілге алған. Батыр Райымбек пен лучница Томирис Бас қолбасшысына көмекке баруға дайын."],
    ["По пути, воины встретят опытного купца-бая Алтынбека, который ищет ответы на вопросы, взамен давая ценные вещи, а молодой пастух Кожа постоянно теряет своих овец или их крадут степные разбойники. Кожа понадобится ваша помощь со счётом овец, потому что сам по молодости не умеет считать. Мудрый аксакал Кудайберген всегда готов пропустить вас через территорию своего аула взамен на что-то ценное и никогда не будет против уделить вам место в своей юрте на ночь.","Жол бойында жауынгерлер тәжірибелі саудагер-бай Алтынбекпен кездеседі, ол сұрақтарға жауап іздейді, оның орнына құнды заттар береді, ал Жас қойшы қойларын үнемі жоғалтады немесе дала қарақшылары ұрлайды. Қойлардың есебіне сіздің көмегіңіз қажет болады, өйткені ол жас кезінде санауды білмейді. Дана ақсақал Құдайберген сізді құнды нәрсенің орнына өз ауылының аумағынан өткізуге әрқашан дайын және сізге түнде киіз үйінде орын беруге ешқашан қарсы болмайды."],
    ["За всеми решениями этих бравых героев будете стоять Вы, со своими знаниями языка программирования Python. Не подведите хана и спасите собачку от грозных джунгар!","Осы батыл кейіпкерлердің барлық шешімдерінің артында сіз Python бағдарламалау тілі туралы біліміңізбен тұрасыз. Ханды жібермеңіз және итті қорқынышты жоңғарлардан құтқарыңыз!"],
    ["Возраст: 26 лет","Жасы: 26 жас"],["Рост: 180см","Биіктігі: 180см"],["Вес: 95кг","Салмағы: 95 кг"],["Характер: храбрый","Мінезі: батыл"],["Оружие: меч","Қару: қылыш"],
    ["Возраст: 22 года","Жасы: 22 жыл"],["Рост: 170см","Биіктігі: 170см"],["Вес: 60кг","Салмағы: 60кг"],["Характер: волевой","Мінезі: ерік"],["Оружие: лук","Қару: садақ"],
    ["Возраст: 73 года","Жасы: 73 жас"],["Рост: 175см","Биіктігі: 175см"],["Вес: 80кг","Салмағы: 80кг"],["Характер: мудрый","Мінезі: дана"],["Статус: хан","Мәртебесі: хан"],
    ["Возраст: 3 года","Жасы: 3 жыл"],["Рост: 75см","Биіктігі: 75см"],["Вес: 22кг","Салмағы: 22кг"],["Характер: спокойный","Мінез: тыныш"],["Статус: охотник","Мәртебесі: аңшы"]]
translation_list_th=[
    ["Имя","Аты"],
    ["Клан","Ру"],
    ["Очки","Ұпайлар"]]
translation_list_label=[
    ["Введите своё имя:","Атыңызды енгізіңіз:"],
    ["ученик","оқушы бала"],["ученица","оқушы қыз"],["учитель","мұғалім"],
    ["В каком классе ты учишься?","Сіз қай сыныпта оқисыз?"],
    ["В каком клане ты хочешь быть?","Сіз қандай кланда болғыңыз келеді?"]
]

update();

function setLanguage(){
    if (localStorage.getItem('lang') == "kz"){localStorage.setItem("lang", "ru");}
    else {localStorage.setItem("lang", "kz");}
    update();}

function update(){
    if (localStorage.getItem('lang') == "kz"){
        document.getElementById("language").innerText = "KZ";
        document.getElementById("name").placeholder = "Атыңызды осы жерге енгізіңіз...";
        document.getElementById("submit").value = "Дайын!"
    }
    else {
        document.getElementById("language").innerText = "RU";
        document.getElementById("name").placeholder = "Введите своё имя здесь...";
        document.getElementById("submit").value = "Готово!"}
    go_through("a", translation_list_a);
    go_through("h1", translation_list_h1);
    go_through("h2", translation_list_h2);
    go_through("p", translation_list_p);
    go_through("th", translation_list_th);
    go_through("label", translation_list_label)}

function go_through(item, list){
    document.querySelectorAll(item).forEach((x,b) => {
        for (let i = 0; i < list.length;i++){
            if (x.innerText == list[i][0] && localStorage.getItem('lang') == "kz"){x.innerText = list[i][1];}
            else if (x.innerText == list[i][1] && localStorage.getItem('lang') == "ru"){x.innerText = list[i][0];}}})}